const { saveCard } = require('./dist/cardNode');

let data = {
  name: 'meigui',
  _id: '59438930',
  type: 'monster',
  type2: 'xg',
  type3: '',
  type4: '',
  attack: 0,
  defend: 1800,
  level: 3,
  desc: `「浮幽櫻」的 效 果1回合只能使用1次。①：對方場上的怪獸數量比自己場上的怪獸多的場合，把這張卡從手卡丟棄才能發動。選自己的額外卡組1張卡給雙方確認。那之後，把對方的額外卡組確認，有選的卡的同名卡的場合，那些對方的同名卡全部除外。這個效果在對方回合也能發動。`,
  race: '不死族',
  attribute: 'dark',
  lb_num: 13,
  link: [0, 1, 0, 0, 0, 1, 0, 1],
  cardbag: 'AAAA-JP000',
  lb_desc: '恶魔族怪兽2只这张卡的控制者在每次自己准备阶段支付500基本分。\n或者不支付让这张卡破坏。这张卡的①②的效果在同一连锁上各能发动1次。①：自己把基本分支付的场合才能发动。\n和那个数值相同的攻击力或守备力的1只恶魔族怪兽从卡组送去墓地。在每次自己准备阶段支付500基本分。或者不支付让这张卡破坏。这张卡的①②的效果在同一连锁上各能发动1次。①：自己把基本分支付的场合才能发动。在每次自己准备阶段支付500基本分。或者不支付让这张卡破坏。这张卡的①②的效果在同一连锁上各能发动1次。①：自己把基本分支付的场合才能发动。'
};

saveCard(data, {
  picPath: 'E:/project/ygopic/500/10000.jpg',
  moldPath: './source/mold/',
  type: 'image/png',
  size: 813,
  savePath: './test.png',
})
